## 10. 인덱스


## 참고자료
* [Python 완전정복 시리즈] 2편 : Pandas DataFrame 완전정복 : https://wikidocs.net/book/7188

In [1]:
import pandas as pd
import numpy as np

## 인덱스 (Index)

In [3]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], index=['row1', 'row2', 'row3'], columns=['col1', 'col2', 'col3'])
df.index

Index(['row1', 'row2', 'row3'], dtype='object')

## 열 (columns)

In [4]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

## 데이터 타입 (dtypes)

In [7]:
df.dtypes

col1    int64
col2    int64
col3    int64
dtype: object

## 축 (axes)

In [8]:
df = pd.DataFrame(data=[[1,2],[3,4],[5,6],[7,8]],index=['row1','row2','row3','row4'],columns=['col1','col2'])
df

      col1  col2
row1     1     2
row2     3     4
row3     5     6
row4     7     8

In [9]:
df.axes

[Index(['row1', 'row2', 'row3', 'row4'], dtype='object'),
 Index(['col1', 'col2'], dtype='object')]

In [10]:
df.axes[0]

Index(['row1', 'row2', 'row3', 'row4'], dtype='object')

In [11]:
df.axes[1]

Index(['col1', 'col2'], dtype='object')

## 차원 (ndim)

In [12]:
df1 = pd.Series({'idx1':1,'idx2':2,'idx2':2})
df1

idx1    1
idx2    2
dtype: int64

In [13]:
df2 = pd.DataFrame(data=[[1,2],[3,4]],index=['row1','row2'],columns=['col1','col2'])
df2

      col1  col2
row1     1     2
row2     3     4

In [14]:
df1.ndim

1

In [15]:
df2.ndim

2

## 요소의 갯수 (size)

In [16]:
df1.size

2

In [17]:
df2.size

4

## 차원의 형태 (shape)

In [18]:
data1= [[1,2,3],[4,5,6],[7,8,9]]
df1 = pd.DataFrame(data = data1, index = ['row1', 'row2', 'row3'], columns=['col1','col2','col3'])
df1

      col1  col2  col3
row1     1     2     3
row2     4     5     6
row3     7     8     9

In [19]:
data2 = [[1,2,3,4]]
df2 = pd.DataFrame(data =data2, index = ['row1'], columns=['col1','col2','col3','col4'])
df2

      col1  col2  col3  col4
row1     1     2     3     4

In [21]:
df1.shape

(3, 3)

In [22]:
df2.shape

(1, 4)

## 정보축 (keys)

In [23]:
df.keys

<bound method NDFrame.keys of       col1  col2
row1     1     2
row2     3     4
row3     5     6
row4     7     8>

## 키값(열의 요소) 반환 (get)

In [26]:
data = [[1,2,3],[4,5,6],[7,8,9]]
col = ['col1','col2','col3']
row = ['row1','row2','row3']
df = pd.DataFrame(data=data,index=row,columns=col)
df

      col1  col2  col3
row1     1     2     3
row2     4     5     6
row3     7     8     9

In [27]:
df.get('col1')

row1    1
row2    4
row3    7
Name: col1, dtype: int64

In [30]:
print(df.get('col4'))

None

In [31]:
df.get('col4', default='값이 없습니다')

'값이 없습니다'

## 비교 (compare)

In [33]:
idx = ['row1','row2','row3','row4']
col = ['col1','col2','col3']
data1 = [['A',1,11],['B',2,12],['C',3,13],['D',4,14]]
data2 = [['X',1,11],['B','Y',12],['C',3,13],['D',4,'Z']]
df1 = pd.DataFrame(data1, idx, col)
df2 = pd.DataFrame(data2, idx, col)

In [34]:
df1

     col1  col2  col3
row1    A     1    11
row2    B     2    12
row3    C     3    13
row4    D     4    14

In [35]:
df2

     col1 col2 col3
row1    X    1   11
row2    B    Y   12
row3    C    3   13
row4    D    4    Z

In [36]:
df1.compare(df2)

     col1       col2        col3
     self other self other  self other
row1    A     X  NaN   NaN   NaN   NaN
row2  NaN   NaN  2.0     Y   NaN   NaN
row4  NaN   NaN  NaN   NaN  14.0     Z

In [37]:
df1.compare(other=df2, align_axis=0)

           col1 col2  col3
row1 self     A  NaN   NaN
     other    X  NaN   NaN
row2 self   NaN  2.0   NaN
     other  NaN    Y   NaN
row4 self   NaN  NaN  14.0
     other  NaN  NaN     Z

In [38]:
df1.compare(other=df2, align_axis=1)

     col1       col2        col3
     self other self other  self other
row1    A     X  NaN   NaN   NaN   NaN
row2  NaN   NaN  2.0     Y   NaN   NaN
row4  NaN   NaN  NaN   NaN  14.0     Z

In [39]:
df1.compare(other=df2, keep_shape=True)

     col1       col2        col3
     self other self other  self other
row1    A     X  NaN   NaN   NaN   NaN
row2  NaN   NaN  2.0     Y   NaN   NaN
row3  NaN   NaN  NaN   NaN   NaN   NaN
row4  NaN   NaN  NaN   NaN  14.0     Z

In [40]:
df1.compare(other=df2, keep_shape=False)

     col1       col2        col3
     self other self other  self other
row1    A     X  NaN   NaN   NaN   NaN
row2  NaN   NaN  2.0     Y   NaN   NaN
row4  NaN   NaN  NaN   NaN  14.0     Z

In [41]:
df1.compare(other=df2, keep_equal=True)

     col1       col2       col3
     self other self other self other
row1    A     X    1     1   11    11
row2    B     B    2     Y   12    12
row4    D     D    4     4   14     Z

In [42]:
df1.compare(other=df2, keep_equal=False)

     col1       col2        col3
     self other self other  self other
row1    A     X  NaN   NaN   NaN   NaN
row2  NaN   NaN  2.0     Y   NaN   NaN
row4  NaN   NaN  NaN   NaN  14.0     Z

## 고유한 행의 수 (value_counts)

In [43]:
n=np.NaN
idx = ['row1','row2','row3','row4','row5']
col = ['col1','col2','col3']
data = [['A','Z',3,],['D','Y',n],['B','Z',3],['C','Y',8],['A','Z',3]]
df = pd.DataFrame(data, idx, col)
df

     col1 col2  col3
row1    A    Z   3.0
row2    D    Y   NaN
row3    B    Z   3.0
row4    C    Y   8.0
row5    A    Z   3.0

In [44]:
df.value_counts()

col1  col2  col3
A     Z     3.0     2
B     Z     3.0     1
C     Y     8.0     1
dtype: int64

In [45]:
df.value_counts(subset=['col2', 'col3'])

col2  col3
Z     3.0     3
Y     8.0     1
dtype: int64

In [46]:
df.value_counts(subset='col2',normalize=False)

col2
Z    3
Y    2
dtype: int64

In [47]:
df.value_counts(subset='col2',normalize=True)

col2
Z    0.6
Y    0.4
dtype: float64

In [50]:
df.value_counts(subset=['col2','col3'],sort=False,ascending=False)

col2  col3
Y     8.0     1
Z     3.0     3
dtype: int64

In [49]:
# sort = True 최빈값, ascending : 오름차순

df.value_counts(subset=['col2','col3'],sort=True,ascending=True)

col2  col3
Y     8.0     1
Z     3.0     3
dtype: int64

In [51]:
df.value_counts(subset=['col2','col3'],dropna=False)

col2  col3
Z     3.0     3
Y     8.0     1
      NaN     1
dtype: int64

## 고유한 요소의 수 (nunique)

In [52]:
idx =  ['row1','row2','row3']
col =  ['col1','col2','col3']
data = [[1,1,n],[1,2,6],[1,3,n]]
df = pd.DataFrame(data, idx, col)
df

      col1  col2  col3
row1     1     1   NaN
row2     1     2   6.0
row3     1     3   NaN

In [53]:
df.nunique(axis=0)

col1    1
col2    3
col3    1
dtype: int64

In [54]:
df.nunique(axis=0, dropna=False)

col1    1
col2    3
col3    2
dtype: int64

In [55]:
df.nunique(axis=1)

row1    1
row2    3
row3    2
dtype: int64